/*Написать программу определения корректности ввода пользователем адреса электронной почты. Программа должна проверять следующие условия:
1. наличие символа «@»;
2. минимальный размер адреса – 6 символов (например, a@b.by);
3. слева от символа «@» должен быть, как минимум, один символ;
4. справа от символа «@» должна быть, как минимум, одна точка;
5. справа от последней точки должно быть, как минимум, 2 символа;
6. между символом «@» и следующей за ним точкой должен быть, как минимум, один символ.
*/
function mailCheck(mail) {

}